{
  "architectures": [
    "XLMRobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "bot_info",
    "1": "capability",
    "2": "date_request",
    "3": "emotional_support",
    "4": "farewell",
    "5": "fun",
    "6": "gratitude",
    "7": "greeting",
    "8": "help_request",
    "9": "time_request"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "bot_info": 0,
    "capability": 1,
    "date_request": 2,
    "emotional_support": 3,
    "farewell": 4,
    "fun": 5,
    "gratitude": 6,
    "greeting": 7,
    "help_request": 8,
    "time_request": 9
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.57.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
